app/controllers/index_controller.rb

SELECT * FROM "users" WHERE ("users"."login" = 'yuiseki') LIMIT 1
---
  def show
    @user = User.find_by_login(params["login"])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def users
    @users = User.find(:all, :order => "updated_at DESC")